#+TITLE: Módulo prop.py para generar bancos de preguntas de opción múltiple
#+LANGUAGE: es
#+OPTIONS: toc:t num:t H:4
#+STARTUP: overview

# ─── Configuración de org-babel ───────────────────────────────────
#+PROPERTY: header-args:python :noweb yes

# ─── LaTeX export ────────────────────────────────────────────────
#+LATEX_CLASS: report
# +LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [10pt,a4paper]

#+include: 00preambulo_lecciones.txt

# +LATEX_HEADER: \usepackage{amsfonts,amssymb,amsmath,amsthm,amscd,amsopn}
# +LATEX_HEADER: \usepackage[usenames,dvipsnames]{xcolor}
# +LATEX_HEADER: \usepackage{parskip}
# +LATEX_HEADER: \usepackage{booktabs,paralist}
# +LATEX_HEADER: \usepackage{paralist}
# +LATEX_HEADER: \newtheorem{teorema}{Teorema}
# +LATEX_HEADER: \newtheorem{corolario}[teorema]{Corolario}
# +LATEX_HEADER: \newtheorem{lema}[teorema]{Lema}
# +LATEX_HEADER: \theoremstyle{definition}
# +LATEX_HEADER: \newtheorem{definicion}[teorema]{Definición}
# +LATEX_HEADER: \newtheorem{notacion}[teorema]{Notación}
# +LATEX_HEADER: \newtheorem{ejemplo}[teorema]{Ejemplo}
# +LATEX_HEADER: \newtheorem{ejemplos}[teorema]{Ejemplos}
# +LATEX_HEADER: \newtheorem{contraejemplo}[teorema]{Contraejemplo}
# +LATEX_HEADER: \theoremstyle{remark}
# +LATEX_HEADER: \newtheorem{observacion}[teorema]{Observación}
# +LATEX_HEADER: \newtheorem{observaciones}[teorema]{Observaciones}
# +LATEX_HEADER: \newcommand{\Nn}{\mathbb N}



# +MACRO: box @@latex:\fbox{$1}@@

#+MACRO: codebox @@latex:\fbox{\texttt{$1}}@@

# %\cleardoublepage


** Clase =Proposicion= y su subclase =v= (proposición atómica)

Las proposiciones son expresiones formadas con números, strings y los símbolos
#+begin_center
=&=,\quad =|=,\quad =-=,\quad  =v( )=,\quad =>>=,\quad =**=,\quad =alguno=\quad y\quad  =unoDe= 
#+end_center
construidas según las siguientes reglas:
1. Si =D= es un número o un string (cadena de caracteres) entonces =v(D)= es una
  subclase de =Proposicion= que denominaremos /``variable proposicional''/ o /``proposición atómica''/.
2. Si =P=, =Q= y =R= son proposiciones también lo son:
   - =P&Q= :: (conjunción)
   - =P|Q= :: (disyunción)
   - =-P= :: (negación)
   - =P>>Q= :: (implicación)
   - =P**Q= :: (equivalencia, es decir: /si y solo si/).
   # Las cinco primeras operaciones se llaman respectivamente, conjunción, disyunción, negación, implicación y equivalencia (/si y solo si/). 
   Para facilitar la elaboración expresiones, también incluimos dos operadores lógico menos habituales: 
   - =alguno(P,Q,R)= :: significa que alguna de las proposiciones de la lista es verdadera y
   - =unoDe(P,Q,R)= :: significa que solo una de las proposiciones de la lista es verdadera.

Ejemplo de proposición: ``llueve o no llueve''
#+BEGIN_SRC jupyter-python :exports none :results none
from prop import *
#+END_SRC

#+BEGIN_SRC jupyter-python
v('llueve') | -v('llueve')
#+END_SRC

#+RESULTS:
: v('llueve') | -v('llueve')

Necesitamos que las proposiciones del tipo =v(D)= sean [[https://docs.python.org/3/glossary.html#term-hashable][/``hash-eables''/]], para poder ser utilizadas como claves en un diccionario. 
Para ello necesitamos los métodos =__hash__= y =__eq__=. 

Definamos la clase =Proposicion=
#+NAME: Definición de la clase Proposicion
#+begin_src python :noweb no-export
class Proposicion:
    def __init__(self,data):
        self.data = data
        
    def __hash__(self):
        return hash(self.data)
    
    def __eq__(self, another):
        return hasattr(another, 'data') and self.data == another.data

    <<Operadores lógicos de la clase Proposicion>>
    <<Método de representación de la clase Proposicion>>    
#+end_src

** Valoración de proposiciones

Una valoración es una función =T= que va del conjunto de proposiciones al conjunto ={True,False}= (es decir, a cada proposición le asigna el valor verdadero o el valor falso) y que verifica las siguientes propiedades: si =P= y =Q= son proposiciones entonces

1. ~T(P & Q) = True~\quad únicamente en el caso de que\quad ~T(P) = True~\quad y\quad ~T(Q) = True~.
2. ~T(P | Q) = False~\quad únicamente en el caso de que\quad ~T(P) = False~\quad y\quad ~T(Q) = False~.
3. ~T(-P) = True~\quad únicamente en el caso de que\quad ~T(P) = False~.
Por tanto:  
{{{codebox( T(P \& Q) = T(P) \& T(Q) )}}},\qquad  
{{{codebox( T(P | Q) = T(P) | T(Q) )}}}\quad y \quad 
{{{codebox( T(-P) = not T(P) )}}}.
4. ~T(P >> Q) = False~\quad únicamente en el caso en que\quad ~T(P) = True~\quad y\quad ~T(Q) = False~.
5. ~T(P ** Q) = True~\quad únicamente en el caso en que\quad ~T(P) = T(Q)~.
Por tanto\quad 
{{{codebox( T(P >> Q) = T(-P | Q) )}}}
\quad y\quad 
{{{codebox( T(P ** Q) = T( (P>>Q) \& (Q>>P) ) )}}}.

Y si =A1,...An= son =n= proposiciones, entonces
1. =alguno(A1,...,An)= es =True=\quad si y solo si\quad =A1 | alguno(A2,...,An)= es =True=,
2. =unoDe(A1,...,An)= es =True=\quad si y solo si\quad =(A1 & -alguno(A2,...,An) | (-A1 & unoDe(A2,...,An))= es =True=;
Por tanto
#+begin_center
{{{codebox( T( alguno(A1\,...\,An) ) = T( A1 | alguno(A2\,...\,An) ) )}}}
#+end_center
y
#+begin_center
{{{codebox( T( unoDe(A1\,...\,An) ) =  T( (A1 \& -alguno(A2\,...\,An)) | (-A1 \& unoDe(A2\,...\,An)) ) )}}}.
#+end_center
Cualquier función =F= que vaya del conjunto de proposicionales atómicas (es decir, del tipo =v('algo')=) al conjunto ={True,False}= 
se puede extender al resto proposiciones[fn::En la función =span= de Python hemos elegido el criterio de que a toda proposición =Prop= no incluida explícitamente en el diccionario =F= le asignamos el valor =False= para así completar el dominio de las proposiciones atómicas. 
Esta decisión ha sido completamente arbitraria, y se ha incluido para que efectivamente el dominio de =span= incluya todas las proposiciones atómicas (i.e., variables proposicionales). 
En cualquier caso =span= se ha programado a modo de ilustración, pues no la emplearemos para nada.]
formando una valoración ~T=span(F)~, aplicando las reglas de arriba. 
Dicha extensión es única.

Vamos a implementar como funciones los diccionarios de Python, pues los diccionarios son una colección de pares ='Etiqueta':valor= donde a cada etiqueta solo se le asigna un valor único. 
Por ejemplo, si definimos el siguiente diccionario ={'a':1 , 'a':0 , 'b':2=}, obtenemos un diccionario con dos elementos, donde a ='a'= se le a asignado solo uno de los dos valores introducidos (en concreto el último).
#+BEGIN_SRC jupyter-python  :exports both
print( {'a':1 , 'a':0 , 'b':2} )
#+END_SRC

#+RESULTS:
: {'a': 0, 'b': 2}



** Función  =extension= que extiende una función parcial

# % \begin{itemize}
# % \item una lista =objetivo= que contiene pares
# %   =(proposición:VF)= donde =VF= es el valor =True= o bien el
# %   valor =False=,
# % \item un diccionario de =valores= con proposiones atómicas
# %   (variables proposicionales) y sus valores (=True= o =False=),
# % \end{itemize}

Ahora queremos definir una función de Python (que denominamos =extension=) que, 
dadas una lista =objetivo= y un diccionario con =valores=, 
para una colección de proposiciones atómicas haga crecer (extienda) el diccionario =valores= con nuevas proposiciones atómicas, y sus correspondientes valores, 
necesarios para que se cumplan los pares contenidos en la lista =objetivo=;
o bien que devuelva el diccionario vacío ={}= en caso de que sea imposible hacer cumplir dicha lista =objetivo=.

La diferencia entre la lista =objetivo= y los =valores= es que en =objetivo= se asignan valores a proposiciones (arbitrarias) pero en =valores= solo se asignan valores a /proposiciones atómicas/.

El diccionario extendido es un /modelo lógico/ en el que se cumplen la lista =objetivo= y la función parcial =valores=. 
Ello no quiere decir que no puedan existir otros modelos que consigan lo mismo.

Ejemplo:
#+BEGIN_SRC jupyter-python
print( extension( [ (v('llueve') >> -v('llueve') , True) ], {v('basilisco') : True}) )
#+END_SRC

#+RESULTS:
: {v('basilisco'): True, v('llueve'): False}


Ejemplo:
#+BEGIN_SRC jupyter-python
print( extension( [ (v('llueve'),True), (-v('llueve'),True)], {v('basilisco') : True}) )
#+END_SRC

#+RESULTS:
: {}


** Clase =Marcador=

Usaremos la clase =Marcador= como una herramienta auxiliar para construir el árbol con todas las combinaciones posibles entre una conjunto de enunciados y un conjunto de cuestiones. 
Posteriormente se descartarán de dicho árbol las combinaciones de enunciados y cuestiones que no tengan solución.

Clase =Marcador=
- =objetivo= es una lista de números naturales mayores que cero

La clase =Marcador= es un iterador. Si ~objetivo=[n_1,...,n_k]~ genera todas las listas de la forma =[m_1,...,m_k]= tales que cada =m_i= es un número natural menor que =n_i=
#+BEGIN_SRC jupyter-python
for i in Marcador([2,3,1]):
    print(i)
#+END_SRC

#+RESULTS:
: [0, 0, 0]
: [0, 1, 0]
: [0, 2, 0]
: [1, 0, 0]
: [1, 1, 0]
: [1, 2, 0]

*** Ejemplo de uso

#+NAME: Ejemplo de ProblemaTipo
#+BEGIN_SRC jupyter-python
p = ProblemaTipo( \
      [
          "Considere ",
          [
              Supuesto("A ", v("A")),
              Supuesto("B ", v("B")),
          ],
          [
              Supuesto("y que A implica C. ",    v("A") >> v("C")),
              Supuesto("y que B equivale a D. ", v("B") ** v("D")),
          ],
          "Conteste: ",
          [
              Cuestion("¿Se da C?", v("C")),
              Cuestion("¿Se da D?", v("D")),
              Cuestion("¿Se da E?", v("E"), v("D")),
          ],
      ])
    
for i in p:
    print(i)
#+END_SRC

#+RESULTS:
#+begin_example
('1', 'Considere A y que A implica C. Conteste: ', [('¿Se da C?', True, 1, '')])
('2', 'Considere A y que A implica C. Conteste: ', [('¿Se da D?', False, 1, '')])

 Cuestion: ¿Se da E? rechazada por v('D')

('3', 'Considere A y que B equivale a D. Conteste: ', [('¿Se da C?', False, 1, '')])
('4', 'Considere A y que B equivale a D. Conteste: ', [('¿Se da D?', False, 1, '')])

 Cuestion: ¿Se da E? rechazada por v('D')

('5', 'Considere B y que A implica C. Conteste: ', [('¿Se da C?', False, 1, '')])
('6', 'Considere B y que A implica C. Conteste: ', [('¿Se da D?', False, 1, '')])

 Cuestion: ¿Se da E? rechazada por v('D')

('7', 'Considere B y que B equivale a D. Conteste: ', [('¿Se da C?', False, 1, '')])
('8', 'Considere B y que B equivale a D. Conteste: ', [('¿Se da D?', True, 1, '')])
('9', 'Considere B y que B equivale a D. Conteste: ', [('¿Se da E?', False, 1, '')])
#+end_example


*** Ejemplo de uso

Cuatro exámenes con dos preguntas tipo test cada uno.
#+NAME: Ejemplo de ProblemaVF
#+BEGIN_SRC jupyter-python
enunciado = "Marque las verdaderas:"

banco = [
  ("Todo alumno que va a clase aprueba",   False),
  ("Todo alumno que suspende va a clase",  False),
  ("Todo alumno que sabe aprueba",         True ),
  ("Si aprueban todos eres buen profesor", False),
  ("Si suspenden todos eres mal profesor", False),
  ("Si suspenden todos es frustrante",     True),]

p  = ProblemaVF (enunciado, banco, 3)      # tres preguntas por variante
p0 = iter(p)

for i in range(4):                         # cuatro variantes
    print(next(p0))
#+END_SRC

#+RESULTS: Ejemplo de ProblemaVF
: ('1', 'Marque las verdaderas:', [('Si suspenden todos es frustrante', True), ('Todo alumno que suspende va a clase', False), ('Si aprueban todos eres buen profesor', False)])
: ('2', 'Marque las verdaderas:', [('Todo alumno que sabe aprueba', True), ('Si aprueban todos eres buen profesor', False), ('Todo alumno que suspende va a clase', False)])
: ('3', 'Marque las verdaderas:', [('Si aprueban todos eres buen profesor', False), ('Todo alumno que suspende va a clase', False), ('Todo alumno que va a clase aprueba', False)])
: ('4', 'Marque las verdaderas:', [('Si suspenden todos es frustrante', True), ('Si aprueban todos eres buen profesor', False), ('Todo alumno que sabe aprueba', True)])


# #+begin_example
# ('EjemploVF', '1', 'Marque las verdaderas:', [('Todo alumno que suspende va a clase',  False),\
#                                               ('Si suspenden todos es frustrante',     True ),\
#                                               ('Todo alumno que sabe aprueba',         True )])
#   
# ('EjemploVF', '2', 'Marque las verdaderas:', [('Todo alumno que suspende va a clase',  False),\
#                                               ('Si suspenden todos eres mal profesor', False),\
#                                               ('Todo alumno que sabe aprueba',         True )])
#   
# ('EjemploVF', '3', 'Marque las verdaderas:', [('Todo alumno que va a clase aprueba',   False),\
#                                               ('Si suspenden todos es frustrante',     True ),\
#                                               ('Todo alumno que sabe aprueba',         True )])
#   
# ('EjemploVF', '4', 'Marque las verdaderas:', [('Todo alumno que sabe aprueba',         True ),\
#                                               ('Si aprueban todos eres buen profesor', False),\
#                                               ('Todo alumno que suspende va a clase',  False)])  
# #+end_example

